#include"sort.h"

int main(void)
{
	int order = 0;

	//测试数据
	seqList L;
	seqList data[5] = {
		{
			{1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26},
			26
		},
		{
			{11,12,13,14,15,1,2,3,4,5,6, 10, 16, 1,22,23,2,17,18,19,20,24, 7,8,9,25,26},
			27
		},
		{
			{5,6,7,1,2,3,4,8,9,10,11,12,13,16,17,18,14,25,26,15,19,20,21,22,23,24},
			26
		},
		{
			{180,203,32,46,25,76,17,58,99,100,11,102,13,54,75,6,27,18,19,29,2,82},
			22
		},
		{
			{106,213,325,446,579,654,721,870,917,510,21,632,73,14,815,316,412,18,619,720,21,808,923,25,26},
			25
		}
	};

	while (1)
	{
		cout << "实验十：排序实验" << endl;
		cout << "*****************************************" << endl;
		cout << "*1，分析快速排序性能。\t\t\t*" << endl;
		cout << "*2，按数字3特性划分数组。\t\t*" << endl;
		cout << "*3，希尔排序。\t\t\t\t*" << endl;
		cout << "*4，快速排序。\t\t\t\t*" << endl;
		cout << "*5，堆排序。\t\t\t\t*" << endl;
		cout << "*6，二路归并排序。\t\t\t*" << endl;
		cout << "*\t\t\t\t\t*" << endl;
		cout << "*0，退出程序。\t\t\t\t*" << endl;
		cout << "*****************************************" << endl;
		cout << "请输入菜单编号：\t";
		cin >> order;

		switch (order)
		{
		case 1:
			system("cls");
			cout << "\t【十.1】\t分析快速排序性能" << endl << endl;
			//第一组测试**********************************************************
			cout << "第一组实验（数据量：100）：" << endl;
			creatSeqList(&L, 100);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快排分析如下：" << endl;
			quickSort(&L);
			//********************************************************************
			cout << endl;
			//第二组测试**********************************************************
			cout << "第二组实验（数据量：120）：" << endl;
			creatSeqList(&L, 120);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快排分析如下：" << endl;
			quickSort(&L);
			//********************************************************************
			cout << endl;
			//第三组测试**********************************************************
			cout << "第三组实验（数据量：140）：" << endl;
			creatSeqList(&L, 140);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快排分析如下：" << endl;
			quickSort(&L);
			//********************************************************************
			cout << endl;
			//第四组测试**********************************************************
			cout << "第四组实验（数据量：160）：" << endl;
			creatSeqList(&L, 160);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快排分析如下：" << endl;
			quickSort(&L);
			//********************************************************************
			cout << endl;
			//第五组测试**********************************************************
			cout << "第五组实验（数据量：180）：" << endl;
			creatSeqList(&L, 180);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快排分析如下：" << endl;
			quickSort(&L);
			//********************************************************************
			cout << endl;
			//第六组测试**********************************************************
			cout << "第六组实验（数据量：200）：" << endl;
			creatSeqList(&L);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快排分析如下：" << endl;
			quickSort(&L);
			//********************************************************************
			cout << endl;
			break;
		case 2:
			system("cls");
			cout << "\t【十.2】\t按数字3特性划分数组" << endl << endl;
			//第一组测试**********************************************************
			cout << "第一组实验：" << endl;
			L = data[0];
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "划分过程及结果如下：" << endl;
			partitionThree(&L);
			//********************************************************************
			cout << endl;
			//第二组测试**********************************************************
			cout << "第二组实验：" << endl;
			L = data[1];
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "划分过程及结果如下：" << endl;
			partitionThree(&L);
			//********************************************************************
			cout << endl;
			//第三组测试**********************************************************
			cout << "第三组实验：" << endl;
			L = data[2];
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "划分过程及结果如下：" << endl;
			partitionThree(&L);
			//********************************************************************
			cout << endl;
			break;
		case 3:
			system("cls");
			cout << "\t【十.3】\t希尔排序" << endl << endl;
			//第一组测试**********************************************************
			cout << "第一组实验：" << endl;
			L = data[3];
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "shell排序过程及结果如下：" << endl;
			shellSort(&L);
			//********************************************************************
			cout << endl;
			//第二组测试**********************************************************
			cout << "第二组实验（数据量：30）：" << endl;
			creatSeqList(&L, 30);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "shell排序过程及结果如下：" << endl;
			shellSort(&L);
			//********************************************************************
			cout << endl;
			//第三组测试**********************************************************
			cout << "第三组实验（数据量：100）：" << endl;
			creatSeqList(&L, 100);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "shell排序过程及结果如下：" << endl;
			shellSort(&L);
			//********************************************************************
			cout << endl;
			break;
		case 4:
			system("cls");
			cout << "\t【十.4】\t快速排序" << endl << endl;
			//第一组测试**********************************************************
			cout << "第一组实验：" << endl;
			L = data[4];
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快速排序过程及结果如下：" << endl;
			quickSort(&L, true);
			//********************************************************************
			cout << endl;
			//第二组测试**********************************************************
			cout << "第二组实验（数据量：10）：" << endl;
			creatSeqList(&L, 10);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "快速排序过程及结果如下：" << endl;
			quickSort(&L, true);
			//********************************************************************
			cout << endl;
			break;
		case 5:
			system("cls");
			cout << "\t【十.5】\t堆排序" << endl << endl;
			//第一组测试**********************************************************
			cout << "第一组实验：" << endl;
			L = data[4];
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "堆排序过程及结果如下：" << endl;
			heapSort(&L);
			//********************************************************************
			cout << endl;
			break;
		case 6:
			system("cls");
			cout << "\t【十.6】\t二路归并排序" << endl << endl;
			//第一组测试**********************************************************
			cout << "第一组实验：" << endl;
			L = data[4];
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "二路归并排序过程及结果如下：" << endl;
			mergeSort(&L);
			//********************************************************************
			cout << endl;
			//第二组测试**********************************************************
			cout << "第二组实验（数据量：50）：" << endl;
			creatSeqList(&L, 50);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "二路归并排序过程及结果如下：" << endl;
			mergeSort(&L);
			//********************************************************************
			cout << endl;
			//第三组测试**********************************************************
			cout << "第三组实验（数据量：100）：" << endl;
			creatSeqList(&L, 100);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "二路归并排序过程及结果如下：" << endl;
			mergeSort(&L);
			//********************************************************************
			cout << endl;
			//第四组测试**********************************************************
			cout << "第三组实验（数据量：200）：" << endl;
			creatSeqList(&L, 200);
			cout << "测试数据：\t";
			showSeqList(&L);
			cout << endl;
			cout << "二路归并排序过程及结果如下：" << endl;
			mergeSort(&L);
			//********************************************************************
			cout << endl;
			break;
		case 0:
			cout << "退出程序！" << endl;
			return 0;
		default:
			system("cls");
			cout << "输入错误！" << endl;
			break;
		}
	}

	return 0;
}